# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\FlexSEA_alx87grd\execute\execute_1_0.cydsn\execute_1_0.cyprj
# Date: Wed, 05 Oct 2016 20:01:46 GMT
#set_units -time ns
create_clock -name {CyHBUS_40MHZ(routed)} -period 25 -waveform {0 12.5} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {ADC_DelSig_1_Ext_CP_Clk(routed)} -period 12.5 -waveform {0 6.25} [list [get_pins {ClockBlock/dclk_3}]]
create_clock -name {ADC_CLK(routed)} -period 75 -waveform {0 37.5} [list [get_pins {ClockBlock/dclk_4}]]
create_clock -name {CyXTAL} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/xtal}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyPLL_OUT} -period 12.5 -waveform {0 6.25} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 12.5 -waveform {0 6.25} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {CyBUS_CLK(fixed-function)} -period 12.5 -waveform {0 6.25} [get_pins {ClockBlock/clk_bus_glb_ff}]
create_generated_clock -name {CyHBUS_40MHZ} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_clock -name {CyHBUS_40MHZ(fixed-function)} -period 25 -waveform {0 12.5} [get_pins {ClockBlock/dclk_glb_ff_0}]
create_generated_clock -name {CyADCCLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 81 161} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {CyCLK_6M4HZ} -source [get_pins {ClockBlock/clk_sync}] -edges {1 13 27} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_clock -name {CyCLK_6M4HZ(fixed-function)} -period 162.5 -waveform {0 12.5} [get_pins {ClockBlock/dclk_glb_ff_1}]
create_generated_clock -name {SPIM_Clk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 17 33} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_clock -name {ADC_DelSig_1_Ext_CP_Clk} -period 12.5 -waveform {0 6.25} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {ADC_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 7 13} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {C8M} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 11} [list [get_pins {ClockBlock/dclk_glb_5}]]
create_generated_clock -name {SPIM_2_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 41 81} [list [get_pins {ClockBlock/dclk_glb_6}]]
create_generated_clock -name {ADC_SAR_1_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 81 161} [list [get_pins {ClockBlock/aclk_glb_1}]]
create_clock -name {ADC_SAR_1_theACLK(fixed-function)} -period 1000 -waveform {0 500} [get_pins {ClockBlock/aclk_glb_ff_1}]
create_generated_clock -name {ADC_DelSig_1_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 81 161} [list [get_pins {ClockBlock/aclk_glb_2}]]
create_clock -name {ADC_DelSig_1_theACLK(fixed-function)} -period 1000 -waveform {0 500} [get_pins {ClockBlock/aclk_glb_ff_2}]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\FlexSEA_alx87grd\execute\execute_1_0.cydsn\TopDesign\TopDesign.cysch
# Project: C:\FlexSEA_alx87grd\execute\execute_1_0.cydsn\execute_1_0.cyprj
# Date: Wed, 05 Oct 2016 20:01:27 GMT
